In [1]:
# Import Libraries and Dependencies
import pandas as pd

### 1. Combine and Clean the Data
#### Import CSVs

In [18]:
# Read the CSV files into DataFrames.
athletic_sales_2020 = pd.read_csv('Resources/athletic_sales_2020.csv')

athletic_sales_2021 = pd.read_csv('Resources/athletic_sales_2021.csv')

In [19]:
# Display the 2020 sales DataFrame
print(athletic_sales_2020.head())

      retailer  retailer_id invoice_date     region         state  \
0  Foot Locker      1185732       1/1/20  Northeast      New York
1  Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
2  Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
3  Foot Locker      1185732       1/1/20  Northeast      New York
4  Foot Locker      1185732       1/1/20  Northeast  Pennsylvania

           city                product  price_per_unit  units_sold  \
0      New York  Men's Street Footwear              50        1200
1  Philadelphia        Women's Apparel              68          83
2  Philadelphia        Women's Apparel              75         275
3      New York  Men's Street Footwear              34         384
4  Philadelphia        Women's Apparel              53          83

   total_sales  operating_profit sales_method
0       600000         300000.00     In-store
1         5644           2426.92       Online
2       206250          61875.00       Outlet
3        13056           6789.12       Outlet
4         4399           1407.68       Outlet

In [20]:
# Display the 2021 sales DataFrame
print(athletic_sales_2021.head())

    retailer  retailer_id invoice_date   region       state           city  \
0  West Gear      1128299       1/1/21     West  California  San Francisco
1  West Gear      1128299       1/1/21     West  California  San Francisco
2     Kohl's      1189833       1/1/21  Midwest     Montana       Billings
3     Kohl's      1189833       1/1/21  Midwest     Montana       Billings
4  West Gear      1128299       1/1/21     West  California  San Francisco

                   product  price_per_unit  units_sold  total_sales  \
0  Men's Athletic Footwear              65         750       487500
1  Men's Athletic Footwear              51         233        11883
2            Men's Apparel              50         275       137500
3            Men's Apparel              47          77         3619
4  Men's Athletic Footwear              64         225        14400

   operating_profit sales_method
0         121875.00       Outlet
1           3208.41       Outlet
2          82500.00       Outlet
3           2714.25       Online
4           5184.00       Online

#### Check the data types of each DataFrame

In [21]:
# Check the 2020 sales data types.
print(athletic_sales_2020.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [22]:
# Check the 2021 sales data types.
print(athletic_sales_2021.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [23]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
combined_sales = pd.concat([athletic_sales_2020, athletic_sales_2021], ignore_index=True)

In [24]:
# Check if any values are null.
print(combined_sales.isnull().sum())

retailer            0
retailer_id         0
invoice_date        0
region              0
state               0
city                0
product             0
price_per_unit      0
units_sold          0
total_sales         0
operating_profit    0
sales_method        0
dtype: int64

In [25]:
# Check the data type of each column
print(combined_sales.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [28]:
# Convert the "invoice_date" to a datetime datatype
combined_sales['invoice_date'] = pd.to_datetime(combined_sales['invoice_date'])

In [48]:
# Confirm that the "invoice_date" data type has been changed.
print(combined_sales.dtypes)

retailer                    object
retailer_id                  int64
invoice_date        datetime64[ns]
region                      object
state                       object
city                        object
product                     object
price_per_unit               int64
units_sold                   int64
total_sales                  int64
operating_profit           float64
sales_method                object
dtype: object

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [46]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".
# Show the top 5 results.
region_sales = combined_sales.groupby(['region', 'state', 'city']).agg({'units_sold': 'sum'}).rename(columns={'units_sold': 'Total_Products_Sold'}).reset_index()

top_5_regions_by_products_sold = region_sales.sort_values(by='Total_Products_Sold', ascending=False).head(5)
top_5_regions_by_products_sold

       region       state           city  Total_Products_Sold
21  Northeast    New York       New York               111954
33      South       Texas        Houston                90322
44       West  California  San Francisco                85478
43       West  California    Los Angeles                76384
34  Southeast     Florida          Miami                73135

#### Using `pivot_table`

In [45]:
# Show the number products sold for region, state, and city.
region_sales_pivot = combined_sales.pivot_table(index=['region', 'state', 'city'], values='units_sold', aggfunc='sum').rename(columns={'units_sold': 'Total_Products_Sold'}).reset_index()


# Rename the "units_sold" column to "Total_Products_Sold"
# # Show the top 5 results.
top_5_regions_by_products_sold_pivot = region_sales_pivot.sort_values(by='Total_Products_Sold', ascending=False).head(5)
top_5_regions_by_products_sold_pivot

       region       state           city  Total_Products_Sold
21  Northeast    New York       New York               111954
33      South       Texas        Houston                90322
44       West  California  San Francisco                85478
43       West  California    Los Angeles                76384
34  Southeast     Florida          Miami                73135

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [44]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"
region_total_sales = combined_sales.groupby(['region', 'state', 'city']).agg({'total_sales': 'sum'}).rename(columns={'total_sales': 'Total_Sales'}).reset_index()

# Show the top 5 results.
top_5_regions_by_sales = region_total_sales.sort_values(by='Total_Sales', ascending=False).head(5)
top_5_regions_by_sales

       region           state           city  Total_Sales
21  Northeast        New York       New York     39801235
44       West      California  San Francisco     33973228
34  Southeast         Florida          Miami     31600863
39  Southeast  South Carolina     Charleston     29285637
35  Southeast         Florida        Orlando     27682851

#### Using `pivot_table`

In [43]:
# Show the total sales for the products sold for each region, state, and city.
# Optional: Rename the "total_sales" column to "Total Sales"
region_total_sales_pivot = combined_sales.pivot_table(index=['region', 'state', 'city'], values='total_sales', aggfunc='sum').rename(columns={'total_sales': 'Total_Sales'}).reset_index()

# Show the top 5 results
top_5_regions_by_sales_pivot = region_total_sales_pivot.sort_values(by='Total_Sales', ascending=False).head(5)
top_5_regions_by_sales_pivot

       region           state           city  Total_Sales
21  Northeast        New York       New York     39801235
44       West      California  San Francisco     33973228
34  Southeast         Florida          Miami     31600863
39  Southeast  South Carolina     Charleston     29285637
35  Southeast         Florida        Orlando     27682851

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [49]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Rename the "total_sales" column to "Total Sales"
retailer_total_sales = combined_sales.groupby(['retailer', 'region', 'state', 'city']).agg({'total_sales': 'sum'}).rename(columns={'total_sales': 'Total_Sales'}).reset_index()


# Show the top 5 results.
top_5_retailers_by_sales = retailer_total_sales.sort_values(by='Total_Sales', ascending=False).head(5)
top_5_retailers_by_sales

        retailer     region           state           city  Total_Sales
103    West Gear       West      California  San Francisco     32794405
50        Kohl's       West      California    Los Angeles     25127160
22   Foot Locker  Northeast        New York       New York     25008568
109    West Gear       West      Washington        Seattle     24862675
33   Foot Locker  Southeast  South Carolina     Charleston     24822280

#### Using `pivot_table`

In [64]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Optional: Rename the "total_sales" column to "Total Sales"
retailer_total_sales_pivot = combined_sales.pivot_table(index=['retailer', 'region', 'state', 'city'], values='total_sales', aggfunc='sum').rename(columns={'total_sales': 'Total_Sales'}).reset_index()

# Show the top 5 results.
top_5_retailers_by_sales_pivot = retailer_total_sales_pivot.sort_values(by='Total_Sales', ascending=False).head(5)
top_5_retailers_by_sales_pivot

        retailer     region           state           city  Total_Sales
103    West Gear       West      California  San Francisco     32794405
50        Kohl's       West      California    Los Angeles     25127160
22   Foot Locker  Northeast        New York       New York     25008568
109    West Gear       West      Washington        Seattle     24862675
33   Foot Locker  Southeast  South Carolina     Charleston     24822280

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [51]:
# Filter the sales data to get the women's athletic footwear sales data.
womens_footwear_sales = combined_sales[combined_sales['product'] == "Women's Athletic Footwear"]

#### Using `groupby`

In [52]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
womens_footwear_retailer_sales = womens_footwear_sales.groupby(['retailer', 'region', 'state', 'city']).agg({'units_sold': 'sum'}).rename(columns={'units_sold': 'Womens_Footwear_Units_Sold'}).reset_index()

# Show the top 5 results.
top_5_womens_footwear_retailers = womens_footwear_retailer_sales.sort_values(by='Womens_Footwear_Units_Sold', ascending=False).head(5)
top_5_womens_footwear_retailers

,retailer,region,state,city,Womens_Footwear_Units_Sold
101,West Gear,West,California,San Francisco,12107
22,Foot Locker,Northeast,New York,New York,10996
49,Kohl's,West,California,Los Angeles,10826
33,Foot Locker,Southeast,South Carolina,Charleston,8814
68,Sports Direct,South,Texas,Dallas,8790

#### Using `pivot_table`

In [66]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
womens_footwear_sales = combined_sales[combined_sales['product'] == "Women's Athletic Footwear"]

# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
womens_footwear_retailer_sales_pivot = womens_footwear_sales.pivot_table(index=['retailer', 'region', 'state', 'city'], values='units_sold', aggfunc='sum').rename(columns={'units_sold': 'Womens_Footwear_Units_Sold'}).reset_index()

# Show the top 5 results.
top_5_womens_footwear_retailers_pivot = womens_footwear_retailer_sales_pivot.sort_values(by='Womens_Footwear_Units_Sold', ascending=False).head(5)
top_5_womens_footwear_retailers_pivot

,retailer,region,state,city,Womens_Footwear_Units_Sold
101,West Gear,West,California,San Francisco,12107
22,Foot Locker,Northeast,New York,New York,10996
49,Kohl's,West,California,Los Angeles,10826
33,Foot Locker,Southeast,South Carolina,Charleston,8814
68,Sports Direct,South,Texas,Dallas,8790

### 6. Determine the Day with the Most Women's Athletic Footwear Sales

In [61]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
# Optional: Rename the "total_sales" column to "Total Sales"
daily_sales = womens_footwear_sales.pivot_table(index='invoice_date', values='total_sales', aggfunc='sum').rename(columns={'total_sales': 'Total_Sales'})

# Show the table.
daily_sales

              Total_Sales
invoice_date
2020-01-04         402743
2020-01-05         141801
2020-01-11         129556
2020-01-17         173013
2020-01-22         388250
...                   ...
2021-12-22         200406
2021-12-23         808022
2021-12-24         190885
2021-12-25         315175
2021-12-30         167903

[355 rows x 1 columns]

In [62]:
# Resample the pivot table into daily bins, and get the total sales for each day.
daily_sales_resampled = daily_sales.resample('D').sum()

# Sort the resampled pivot table in descending order on "Total Sales".
top_days_womens_footwear_sales = daily_sales_resampled.sort_values(by='Total_Sales', ascending=False).head(10)
top_days_womens_footwear_sales

              Total_Sales
invoice_date
2021-07-16        1521825
2021-12-16        1473497
2021-06-17        1376988
2021-08-17        1086294
2021-07-23        1021806
2021-11-17        1021145
2021-12-09         915011
2021-06-24         884238
2021-07-09         869054
2021-08-10         839120

### 7.  Determine the Week with the Most Women's Athletic Footwear Sales

In [63]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
weekly_sales_resampled = daily_sales.resample('W').sum()

# Sort the resampled pivot table in descending order on "Total Sales".
top_weeks_womens_footwear_sales = weekly_sales_resampled.sort_values(by='Total_Sales', ascending=False).head(10)
print(top_weeks_womens_footwear_sales)

              Total_Sales
invoice_date
2021-12-19        3098970
2021-12-12        2922161
2021-07-11        2835078
2021-07-18        2801449
2021-11-14        2531721
2021-08-22        2491259
2021-08-15        2463941
2021-11-21        2449537
2021-05-16        2422132
2021-06-13        2358602